challenges/payroll-buddy/app/controllers/salaries_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 548  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "salary" = ?, "updated_at" = ? WHERE "users"."id" = 548  [["salary", 25000], ["updated_at", "2015-02-19 11:41:14.026904"]]
---
  def update
    user = User.find(salary_params[:user_id])
    if current_user.manages?(user.organisation)
      user.salary = salary_params[:amount].to_i
      user.save