challenges/weight-tracker/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-19 11:09:08.870629"], ["email", "123456789"], ["name", "fox@fox.com"], ["updated_at", "2015-02-19 11:09:08.870629"]]
---
  def create
    user = User.create(user_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 350]]
UPDATE "users" SET "medications" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = 350  [["medications", "none"], ["password", "123456789"], ["updated_at", "2015-02-19 11:09:30.519242"]]
---
  def update
    @user = User.find(params[:id])
    @user.update_attributes(user_params)