challenges/project-amazing/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-19 15:33:36.698487"], ["description", "<script>alert('die')</script>"], ["title", "hi"], ["updated_at", "2015-02-19 15:33:36.698487"], ["user_id", 1]]
---
  def create
    @task = current_user.tasks.new(task_params)

    respond_to do |format|
      if @task.save

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
    def set_task
      @task = current_user.tasks.find(params[:id])