challenges/project-amazing/app/views/users/index.html.haml

SELECT "users".* FROM "users"
---
  %tbody
    -User.all.each do |u|